# SetPresentationMode Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
Rebar..::..SetPresentationMode Method
Rebar Class See Also
---
Sets the presentation mode for this rebar set when displayed in the given view.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2015
# Syntax
C#
---
```text
public void SetPresentationMode(
	View dBView,
	RebarPresentationMode presentationMode
)
```

Visual Basic
---
```text
Public Sub SetPresentationMode ( _
	dBView As View, _
	presentationMode As RebarPresentationMode _
)
```

Visual C++
---
```text
public:
void SetPresentationMode(
	View^ dBView,
	RebarPresentationMode presentationMode
)
```

# ### Parameters
dBView
    Type: Autodesk.Revit.DB..::..View The view.
presentationMode
    Type: Autodesk.Revit.DB.Structure..::..RebarPresentationMode The presentation mode.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | This rebar cannot have a presentation mode applied for dBView, as the view is not valid for rebar presentation, or the orientation of the view matches the normal direction of the rebar element. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions..::..InapplicableDataException | This rebar element represents a single bar (the layout rule is Single). |

# See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace